In [1]:
import pandas as pd
import numpy as np

In [2]:
suppliers = pd.read_csv("./northwind-mongo-master/suppliers _del_1.csv", usecols=["SupplierID", "CompanyName", "City"])

In [3]:
products = pd.read_csv("./northwind-mongo-master/products_del_1.csv", usecols=['ProductID', 'ProductName', 'SupplierID'])

In [4]:
suppliers.merge(products, on='SupplierID').head(3)

   SupplierID     CompanyName    City  ProductID    ProductName
0           1  Exotic Liquids  London          1           Chai
1           1  Exotic Liquids  London          2          Chang
2           1  Exotic Liquids  London          3  Aniseed Syrup

In [5]:
suppliers.merge(products, left_index=True, right_on="SupplierID").head(3)

,SupplierID,SupplierID_x,CompanyName,City,ProductID,ProductName,SupplierID_y
0,1,2,New Orleans Cajun Delights,New Orleans,1,Chai,1
1,1,2,New Orleans Cajun Delights,New Orleans,2,Chang,1
2,1,2,New Orleans Cajun Delights,New Orleans,3,Aniseed Syrup,1

In [6]:
products.set_index("SupplierID",inplace=True)

In [7]:
suppliers.join(products).head(3)

   SupplierID                 CompanyName         City  ProductID ProductName
0           1              Exotic Liquids       London        NaN         NaN
1           2  New Orleans Cajun Delights  New Orleans        1.0        Chai
1           2  New Orleans Cajun Delights  New Orleans        2.0       Chang

In [8]:
suppliers.reset_index(inplace=True)

In [9]:
suppliers.merge(products, left_on="SupplierID", right_index=True).head(3)

   index  SupplierID     CompanyName    City  ProductID    ProductName
0      0           1  Exotic Liquids  London          1           Chai
0      0           1  Exotic Liquids  London          2          Chang
0      0           1  Exotic Liquids  London          3  Aniseed Syrup

In [10]:
products.reset_index(inplace=True)

In [11]:
products.rename({'SupplierID':'supplier_id'}, axis=1, inplace=True)

In [12]:
suppliers.merge(products, left_on="SupplierID", right_on="supplier_id").head(3)

,index,SupplierID,CompanyName,City,supplier_id,ProductID,ProductName
0,0,1,Exotic Liquids,London,1,1,Chai
1,0,1,Exotic Liquids,London,1,2,Chang
2,0,1,Exotic Liquids,London,1,3,Aniseed Syrup